[
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Diseases", "Soil", "Pruning", "Propagation", "Poisonous Plant Info", "Why are the new leaves on my Croton Plant green? It gets plenty of bright light.", "Is it true that Croton houseplants are poisonous? My cat seems to love the plant.", "Should I or shouldn’t I leaves the flowers on my Croton plant?", "Can I save a Croton Plant that lost all its leaves. Went on vacation, soil got very dry, leaves feel off.", "What is the fine webbing on my Croton Plant? Is it just dust or will it hurt the plant?"], "name": ["Croton Plant"], "value": ["Croton houseplants need  ", " to maintain their colorful leaves. If there is insufficient light, new leaves are green not predominantly yellow, red, or orange. Too much direct sun causes phototoridation, a condition that makes Croton leaves gray and dull looking.", "Allow the top 25-30% of the soil to dry out before watering a Croton Plant. Crunchy leaves indicate over-watering. Leaves become soft and droop when your Croton needs water. When a Croton is severely over or under-watered leaves drop  off.", "Fertilize a Croton houseplant monthly in the spring and fall and every two weeks in the summer with a basic houseplant food at 1/2 the recommended strength. If your Croton is in a bright sunny spot, but the new leaves are coming in green, reduce the amount of plant food.  Too much  ", " also causes the leaves to curl.", "Croton Plants prefer warm temperatures between 60-80 degrees.", "High humidity is a plus for your Croton Plant.", "The flowers on a croton houseplant are small and inconsequential. Remove them as soon as they appear so they don't drain the plant's energy and hinder leaf development.", "Crotons are susceptible to  ", ",  ", ", and  ", " but it is  ", " that do the most damage. Because Croton houseplants have multi-colored leaves, it is often difficult to see the  ", ". These plant pests suck the color from the leaves and ruin the plant. Thoroughly spray your Croton with the  ", " once a month as a preventative measure.", "Fungal and bacteria infections may occur because of the humid environment and moist soil Crotons require, the most common being  ", " and  ", ".", "Use a rich potting soil for your Croton houseplants. The soil should be loose and drain well but still retain water.", "Trim the stems of your Croton to encourage new growth to keep the plant bushy and full.", "Stem cuttings and  ", " are the best way to propagate Croton houseplants. Individual leaves can be rooted and used in dish gardens.", "Crotons are very  ", " with a #3 toxicity  ", ".", "Croton leaf color develops best in a bright but cool location. Move your plant to a location that is not quite as warm and reduce the amount  ", " you are giving your Croton.", "Croton Plants are extremely  ", ". The sap from a Croton Plant will irritate your skin and stain your clothes. More importantly, a Croton has a #3 toxicity  ", ", which means ingesting any part of the plant can cause serious digestive and respiratory problems.", "I recommend removing the Croton flower and its stalk as soon as possible. Flowering hinders leaf production and the sap from the flowers may cause plant diseases and attract plant pests.", "Since the roots are probably still intact, I think you may be able to save your croton. Cut the bare stems back to about 2” above the soil. Move your Croton to a bright location and keep the barely soil moist but not soggy. Use a product called  ", " every time you water. Be patient, the plant should eventually look better than ever.", "The fine webbing indicates that your Croton has  ", ", a very harmful plant pest that sucks the color from the plant leaves. Spray your Croton with the \" ", ".\" This is a mixture of 1/2 water,1/2 alcohol, a few drops of mineral oil, and a few drops of biodegradable soap. Repeat the spraying in 10 days."], "species": ["Codiaeum variegatum"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Diseases", "Soil", "Pot Size", "Pruning", "Propagation", "Poisonous Plant Info", "How do you prune a Coffee Plant?", "I had my Coffee Plant right in front of an east facing window for about 6 months & it did great. Now it's winter and the plant is staring to look bad. What happened?", "Why is my Coffee Plant getting brown tips?"], "name": ["Coffee Plant"], "value": ["Coffee Plants need  ", " from an east or west facing window. Avoid direct sunlight.", "Water a Coffee Plant when the top 1\"-2\" of soil has dried out. These plants are not drought resistant and can suffer permanent damage if the soil totally dries out. Leaves fall off if the plant is over or under watered.", "A Coffee Plant really only needs to be fed twice a year, once in March and again in late summer. Use a well balanced plant food (10-10-10) or fish emulsion", "These plants prefer constant temperatures between 60 degrees and 75 degrees. Coffee Plants can suffer damage if the temperature goes below 42 degrees or above 78 degrees.", "A Coffee Plant needs high humidity so consider placing a small humidifier near it or setting it on a wet pebble tray.", "As a Coffee Plant matures it produces small white fragrant blooms, followed by red berries. Inside the red berries are the seeds or beans that can be roasted and ground into coffee.", "Keep an eye out for  ", ",  ", ",  ", ", and  ", "These plants require high humidity which makes them susceptible to fungal diseases such as leaf spot and leaf rust.", "Use a porous light weight acidic soil that also contains some peat moss or humus.", "Repot Coffee plants in the spring if they have outgrown their current pot.", "Aggressively cut back straggly new growth to keep the plant short and bushy.", "Coffee Plants are best propagated using fresh seeds found inside the bright red berries. Stem cuttings have very little success.", "Although Coffee Plants are not toxic to humans, the caffeine in the berries can adversely affect small children, cats, and dogs causing hyper-activity, diarrhea, and vomiting.", "When you have a Coffee Plant as a houseplant you need to prune aggressively to maintain its bushy compact shape. Use a sharp scissors and cut the stems at a 45 degree angle about 1/4\"-1/8\" above a leaf axil.", "A couple of things could have happened. Your Coffee Plant may be getting too cold if a draft is coming in from the window. It may not be getting enough light now that the seasons have changed. You may be watering it too much. A Coffee Plant needs less water in the fall and winter than in the spring and summer.", "Coffee plants usually get brown tips when there is not enough humidity in the air. You can place a small humidifier near the plant or you can put your Coffee Plant on a wet pebble tray. If you use the pebble tray be sure the plant is resting on the pebbles and not in the water. I don't recommend misting since this increases the chance of fungal infections."], "species": ["c.arabica"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Diseases", "Soil", "Propagation", "Poisonous Plant Info", "1. How do I care for my Coleus Plant so it isn't so thin and leggy?", "2. Why is my Coleus Plant droopy when the soil is still wet?", "3. Why do the colors of the leaves of my Coleus Plant look faded. I have my Coleus hanging in a huge south facing window. The Coleus Plant gets plenty of sun.", "4. Can I move my Coleus Plant outside for the summer?", "Should I leave the flowers on my Coleus Plant or cut them off?"], "name": ["Coleus Plant"], "value": ["Very  ", " is a must for a Coleus Plant. Coleus Plants can even gradually get used to a few hours of direct sunlight. Florescent  ", " help make the foliage leaf color of a Coleus Plant even more spectacular.", "A Coleus Plant is a fast growing houseplant and dries out more quickly than many other indoor plants. Allow the top inch or two of soil in a Coleus Plant to dry out before watering. Frequent wilting due to under-watering causes the leaves of a Coleus Plant to develop crispy edges, dull colors, and brown spots. Over-watering a Coleus Plant results in root rot.", "The best  ", " for a Coleus Plant is fish emulsion. If fish emulsion is not available, feed a Coleus Plant monthly with a basic balanced plant food at 1/2 the recommended strength.", "A Coleus  Plant likes warm temperatures between 70-85 degrees though it can survive in temperatures as low as 55 degrees.", "Coleus Plants plant like high humidity.", "Pinch the small flowers off of a Coleus Plant as soon as they appear to encourage the beautiful leaves to grow.", " ", ",  ", ", and  ", " are plant pests attracted to a Coleus Plant. Check your Coleus Plant weekly so these pests don’t get a foothold on too many of the vibrant colored leaves. Washing a Coleus Plant frequently with warm water helps keep insects away. Once infested, spray the plant with the  ", " (recipe in Glossary) and also place a Yellow Sticky Insect Cards on the soil to trap flying insects.", "Because a Coleus Plant likes high humidity,  ", " can be a plant disease problem.", "Use a quick draining well-aerated potting soil for a Coleus Plant. Add sand or perlite if the soil is too heavy.", "A Coleus Plant is easily propagated from stem cuttings.", "A Coleus Plant is not considered  ", ", but nor is it considered totally safe. I'd keep it away from pets and children.", "There are several things you can do for your Coleus Plant if it is thin and leggy. Aggressively prune your Coleus plant, depending how bad the plant looks you can even go as far as the soil line. After pruning your Coleus Plant,  move your Coleus to a brighter location or place it under some florescent  ", " if you don’t have enough natural light.", "A Coleus Plant droops even though the soil is wet when the plant is over-watered and all or some of the roots have died. Prune your Coleus Plant back and allow the soil to dry out. Hopefully there are still a few roots left that will allow your Coleus Plant to start growing again.", "The colors in the leaves of your Coleus Plant are fading because the plant is getting too much direct sun light.  Move your Coleus Plant to an area that gets bright indirect or filtered light but no direct sun. The colors in the new leaves should be vibrant once again.", "A Coleus Plant can be moved outside for the summer just be careful that it does not get too much direct sunlight and be sure to bring it inside before temperatures go below 55 degrees.", "I recommend cutting the flowers off of a Coleus Plant as soon as they appear. The flowers on a Coleus Plant hinder the growth of the beautiful, colorful leaves."], "species": ["Solenostemon"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Soil", "Pot Size", "Pruning", "Propagation", "Resting Period", "Poisonous Plant Info", "1. How do I get a Donkey's Tail Plant to bloom?", "2. Can you tell me what the white sticky cottony looking things on my Donkey’s Tail Plant are.", "3. Is a Lamb’s Tail Plant the same as a Donkey’s Tail Plant?", "4. Why are the leaves on my Donkey’s Tail Plant are getting further apart on the stem?", "5. My Mom told me that my Donkey’s Tail  Plant is very poisonous & I should keep it away from my cat. Is this true?"], "name": ["Donkey’s Tail Plant"], "value": ["A Donkey’s Tail Plant needs at least four hours of sun or very  ", " every day. If a Donkey's Tail Plant gets insufficient light the new growth will be small, pale, and weak.", " ", " need to dry out before you water and a Donkey’s Tail Plant is no exception. Water a Donkey's Tail Plant well and then do not water the plant again until the soil has thoroughly dried out. Over-watering a Donkey's Tail Plant or any  ", " is the easiest way to kill it. The leaves of a Donkey's Tail Plant should be flat and even a little wrinkled before you water. A Donkey’s Tail Plant takes even less water in the winter when it is “resting.”", "Fertilize a Donkey’s Tail Plant monthly from March through September. Always dilute the plant food you give a Donkey's Tail Plant to 1/2 the recommended strength. Never fertilize a Donkey's tail Plant during the winter when the plant is resting.", "A Donkey's Tail Plant grows best when the temperature is between 65-75 degrees. During the winter, when a Donkey's Tail Plant is resting, lower the temperature by 10 degrees. Keep a Donkey’s Tail Plant out of drafts and away from cold doors & windows.", "A Donkey's Tail Plant does well in basic household humidity.", "When allowed to rest in the winter in a cool area, a Donkey's Tail Plant may produce star- shaped flowers in pink, red, or lavender.", " ", " are the main pests that attack a Donkey’s Tail Plant.", "The soil for a Donkey's Tail Plant should be loose and fast draining such as a cactus or  ", " mix.", "A Donkey's Tail Plant like to be root-bound in a small pot.", "If leaves on a stem of a Donkey's Tail Plant fall off or are knocked off, cut the stem off.", "Propagate a Donkey's Tail Plant by stem cuttings and  ", ". A Donkey's Tail Plant is so easy to propagate, it almost propagates itself.", "A Donkey's Tail Plant likes to rest in a cool,  ", " area in the winter. Keep the soil of a Donkey's Tail Plant even drier during this resting period.", "Donkey's Tail Plant is the common name for Sedum Morgiana and is non- ", " houseplant. A Donkey's Tail Plant should not be confused with Euphorbia myrsinites which is Creeping Spurge or Myrtle Spurge. Some mistakenly refer to this plant as a Donkey’s Tail Plant. Myrtle Spurge is  ", " and care should be taken when handling it.", "Here are a few suggestions how to get a Donkey's Tail Plant to bloom, although I can’t promise they will work. Hang your Donkey's Tail Plant in a very bright location where the temperature is between 65-75 degrees in the spring, summer, & fall. During the winter, allow the Donkey’s Tail Plant to rest in a cooler location, give it even less water than you usually do, and don’t fertilize at all. In the spring start your usual care again. Be patient!", "The white, sticky, cottony looking things on your Donkey’s Tail Plant is  ", ". Your Donkey's Tail Plant needs to be sprayed with the “ ", ".” The entire plant needs to be sprayed including all sides of the leaves. Move the leaves gently and carefully when you spray, because the leaves of a Donkey's Tail Plant fall off very easily when moved around..", "Yes it is. A Donkey’s Tail Plant has several names including Lamb’s Tail Plant, Burro’s Tail Plant, and even Horse’s Tail Plant. The scientific name for a Donkey's tail Plant is Sedum morganianum", "The leaves on the stem of your Donkey’s Tail Plant are getting farther apart because the plant is not  getting enough sun. A Donkey's Tail Plant needs to be near very bright or direct sun for a large part of the day.  Donkey's Tail Plants do not do well in lower light.", "Your Mom is thinking of Euphorbia myrsinites (creeping splurge) sometimes mistakenly called a Donkey’s Tail Plant.  Creeping Splurge is highly toxic, Donkey's tail Plant is a non- ", " houseplant."], "species": ["Sedum Morganianum"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Soil", "Pot Size", "Pruning", "Propagation", "Poisonous Plant Info", "1. The green leaves are falling off of my Goldfish Plant.", "2. My plant is beautiful but it never gets flowers.", "3. Can I root my Goldfish from stem tip clippings?", "4. I think my plant has mealy bugs. There is white sticky stuff and I can even see the tiny bugs. How can I get rid of them?"], "name": ["Goldfish Plant"], "value": ["A Goldfish Plant requires  ", " especially if you want it to develop flowers.", "Allow the top 25%-30% of the soil in a Goldfish Plant to dry out before watering. Green leaves fall off a Goldfish Plant when the plant is too wet or too dry.", "Fertilize a Goldfish Plant every two weeks in the spring and summer when it is actively growing with a basic plant food at 1/2 the recommended strength. Feed a Goldfish Plant monthly in the fall and winter.", "Goldfish Plants do well in temperatures between 65-85 degrees. Intense heat burns the leaves of a Goldfish Plant. Try to keep a Goldfish Plants out of drafts and away from heaters.", "Goldfish Plants prefer high humidity, but adapt well to basic household humidity.", "Keep a Goldfish Plant in a small pot and in a very bright location to encourage it to flower.", "Goldfish Plants attract the plant pests  ", " and  ", ". It’s difficult to eliminate these plant pests once they have infected a Goldfish Plant because of the numerous small leaves where they love to hide. Spray a Goldfish Plant  thoroughly with the  ", " to get rid of plant pests but try to avoid the flowers.", "Goldfish Plants like a rich potting soil that holds water but still drains quickly. An African Violet soil works well for a Goldfish Plant also.", "Goldfish Plants are usually found in 6\" and 8\" pots.", "Trim a Goldfish Plant aggressively to keep it full and in bloom.\r\nGoldfish Plant stems can get quite long, but Goldfish Plants look better and bloom more if you keep the stems between 12-18 inches (30-45 cm).", "Propagate a Goldfish Plant using stem cuttings from healthy new growth.", "A Goldfish Plant is a slightly  ", " houseplant with a  ", " #1 toxicity.", "The first thing to check is your soil, be sure it is not too soggy or too dry. If it doesn't appear to be a watering problem, your plant may just be going into a \"rest period.\" Trim back the bare branches, put the plant in lower light, and let the soil stay fairly dry. After about 4-6 weeks return it to a bright warm location and it should start to grow again.", "Move your Goldfish plant to a brighter location and stress it a little by letting the plant get really dry every once in a while.", "You can try, but it’s not as easy as an ivy. Be sure to keep your new little Goldfish plants in a plastic bag with high humidity until the stems are rooted.", "It’s difficult to get rid of  ", " on a Goldfish plant because there are so many leaves where the bugs can hide. Spray every part of the plant, especially both sides of all of the leaves, with the “ ", "”, undiluted alcohol mixed with a few drops of mineral oil, and a few drops of biodegradable soap. Repeat every 10 days for at least a month"], "species": ["Columnea nematanthus"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Diseases", "Soil", "Pot Size", "Pruning", "Propagation", "Poisonous Plant Info", "How do I stop my top heavy Dieffenbachia houseplant from falling over?", "Why do the bottom leaves on my Dieffenbachia turn yellow?", "Why do the edges of the leaves on my Dieffenbachia Plant turn brown and curl under?", "Why do the bottom leaves of my Dieffenbachia plant keep dying while the top of the plant gets new leaves?"], "name": ["Dieffenbachia Plant"], "value": ["Dieffenbachia Houseplants require medium to  ", ". Direct sun burns the leaves and too much  ", " causes the vibrant leaf color to fade. When an indoor Dieffenbachia Plant does not get enough light, the new leaves are small and far apart on the stem.", "Water Dieffenbachia Houseplants well and then allow the top 2\"-3\" of soil to dry out before watering again. These plants do best when watered on a regular schedule.", "Fertilize your Dieffenbachia only when the plant is actively producing new leaves. Most Dieffenbachia houseplants should be fed every two weeks in the summer and once a month in the spring and fall. Never feed a Dieffenbachia in the winter. Excess plant food causes browning around the edges of the leaves.", "Dieffenbachia Plants prefer temperatures above 60 degrees. The lower leaves on a Dieffenbachia turn yellow when exposed to cold drafts from doors, windows, or air conditioners.", "A Dieffenbachia Plant prefers high humidity but still does well in basic household humidity.", "Dieffenbachia Houseplants develop rather non-descript spath-like flowers. I recommend cutting Dieffenbachia Plant flowers off as soon as they appear since they slow leaf development.", "The main plant pests to look out for on Dieffenbachia houseplants are  ", " and  ", ".", "Humidity loving Dieffenbachia Plants are subject to Bacterial  ", ", Erwinia Blight, and other bacterial diseases.", "The best soil for Dieffenbachia houseplants is a rich organic mixture that drains quickly.", "A Dieffenbachia likes to be a little pot-bound. Repot your plant in the spring if the roots have filled the existing pot. The new container should only be about an inch or two wider than the old container.", "Aggressively prune your Dieffenbachia to keep the plants bushy and prevent them from getting top heavy.", "Propagate Dieffenbachia houseplants using  ", " and stem cuttings.", "Dieffenbachia Plants are extremely  ", " with a #4 toxicity  ", ". If the sap of a Dieffenbachia Plant gets on your skin, wash it off immediately. Seek medical advice if a child or pet ingests any part of a Dieffenbachia.", "I know this will be hard, but the best way to keep a top-heavy Dieffenbachia houseplant from falling over is to cut the top 1/3-1/2 of the Dieffenbachia plant off. The original part of the Dieffenbachia that remains will send out new growth and quickly become a sturdy and bushy plant. You can remove a few of the bottom leaves from the section you cut off and start a new plant. Wear gloves when pruning Dieffenbachia houseplants. The sap is very toxic and can irritate the skin and inflame existing cuts or sores.", "The bottom leaves on Dieffenbachia Houseplants usually turn yellow when the plant is near a cold draft or an air conditioning vent. They may also turn yellow when the plant is not getting enough light.", "The edges of the leaves of a Dieffenbachia Plant turn brown from too much plant food or too much salt in your water. Rinse the soil of your Dieffenbachia Plant  with distilled water to get rid of any unwanted chemicals.", "It is normal for a Dieffenbachia houseplant to lose its bottom leaves especially if it is not getting enough light. If your Dieffenbachia Plant is looking bare, cut off the top 1/3 of the plant. Cutting off the top of a Dieffenbachia Plant encourages the plant to send out new growth along the main stem and new stems from the roots."], "species": ["Dieffenbachia compacta"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Diseases", "Soil", "Pot Size", "Pruning", "Propagation", "Poisonous Plant Info", "1. Why are the stems of my Crown of Thorns Plant getting mushy and the leaves turning yellow and falling off?", "2. How long should the stem tip cuttings of a Crown of Thorns Plant be if I want to use them for propagation?", "3. How do I get a Crown of Thorns Plant to bloom?", "4. How do I cut back and prune a crown of Thorn Plant that is very top heavy and keeps falling over?"], "name": ["Crown of Thorns Plant"], "value": ["A Crown of Thorns Plant needs as much  ", " as you can provide, but no direct sun.", "When  a Crown of Thorns Plant is actively growing, usually from late spring to early fall, water well and then allow the top 50% of the soil to dry out before watering again. Reduce the amount of water when a Crown of Thorns Plant is not producing new leaves and flowers, but never allow the soil to totally dry out. A Crown of Thorns Plant can get severe root damage if the soil gets too dry.", "Feed a Crown of Thorns Plant monthly when it is actively growing with a water-soluble  ", " at ½ the recommended strength. Use a plant food low in nitrogen and high in phosphorous to limit leaf growth and encourage blooms on a Crown of Thorns Plant.", "A Crown of Thorns Plant likes to be warm and does well in temperatures between 60-96 degrees F. A Crown of Thorns Plant may lose leaves if the temperature goes below 55 degrees F.", "A Crown of Thorns Plant is a desert  ", ", so average to low humidity is sufficient.", "A Crown of Thorns Plant produces colorful bracts in red, yellow, and pink surrounding tiny flowers in the early spring through late summer. Under the right conditions, a Crown of Thorns Plant will bloom all year.", "A Crown of Thorns Plant is very pest resistant.  ", " and  ", " are the main plant pests that could bother a Crown of Thorns Plant.", "Plant Mildew and Plant Fungus are two plant diseases that can develop if a Crown of Thorns Plant is kept too moist or if the humidity is too high. Plant diseases often appear on a Crown of Thorns Plant if the room is cool and the light inadequate so always provide good air circulation and warm temperatures.", "Use a sandy well-drained soil that is 2/3 cactus or  ", " potting soil and 1/3 perlite or coarse sand for a Crown of Thorns Plant. The soil of a crown of Thorns Plant should drain quickly to prevent root-rot.", "A Crown of Thorns Plant needs re-potting about every two or three years.", "You can prune and shape a Crown of Thorns Plant after it has finished blooming.", "Propagate a Crown of Thorns Plant in the spring and early summer using 3”- 4” stem tip cuttings. Be sure to wear gloves to protect your hands from the latex flow that comes from the cuts and the sharp thorns on the stem of a Crown of Thorns Plant. Dip the Crown of Thorns stem tip cuttings in cold water and spray the trimmed areas on the Mother plant with cold water to stop the oozing milky sap. Allow Crown of Thorns plant clippings to dry out for a few days and form a callus before planting them.", "A Crown of Thorns Plant is a  ", " houseplant with a  ", " #2 toxicity. Broken or damaged leaves and stems of a Crown of Thorns Plant ooze a milky latex substance that may cause blistering and pain if you have any open cuts. If a child or pet eats  part of a Crown of Thorns Plant, severe mouth irritation, gastro- intestinal problems, and even hemorrhage can occur.", "The stems of a Crown of Thorns Plant get mushy and the leaves turn yellow and fall off when the soil of the plant is too wet. Move your Crown of Thorns Plant to a warm bright location with good air circulation. Allow the top 50% of the soil of your crown of Thorns plant to dry out before you water again.", "If you want to propagate a Crown of Thorns Plant use stem tip cuttings that are about 3”-4” in length. A Crown of Thorns Plant is a  ", " houseplant so be sure to allow the stem tips to dry out for a few days and form a callus on the ends before planting them.", "A crown of Thorn Plant needs as much  ", " as possible in order to bloom. Using a plant food low in nitrogen but high in phosphorous also encourages a Crown of Thorn Plant to produce flowers rather than leaves.", "The best way to prune a Crown of Thorns Plant is to cut back a lateral branch to the height you want the plant to be. Wherever you prune a Crown of Thorns Plant, spray the cut with cold water to stop the latex sap from flowing. You can use 3 or 4 inches of the stem tip cuttings of a Crown of Thorn Plant to start a new plant."], "species": ["Euphorbia milii"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Pests", "Soil", "Propagation", "Poisonous Plant Info", "1. The leaves on my creeping fig keep shriveling and falling off.", "2. I am misting my ficus pumila every day to increase the humidity, but now I have these tiny white sticky cotton- like things all over the plant?", "3. How often should I repot a creeping fig?", "4. The leaves of my ficus repens used to be a really dark green now they’re pale and sort of anemic looking."], "name": ["Creeping Fig Plant"], "value": ["A Creeping Fig needs indirect light from an east or west-facing window. Those with variegated leaves require even more light. These plants do surprisingly well in strong artificial light.", "Keep the soil moist but never soggy. A Creeping Fig deteriorates if allowed to repeatedly dry out.", "Fertilize a Creeping Fig monthly in the spring, summer, and fall with a basic houseplant food at 1/2 the recommended strength. During fall and winter, fertilize every other month.", "A Creeping Fig does well in temperatures between 55-75 degrees.", "This plant likes plenty of humidity, Placing it on a pebble tray filled with water (do not allow the plant to sit in the water) increases the humidity.", "Creeping Figs attract  ", ",  ", ",  ", ", and  ", ".", "Use a highly organic peat-based soil that drains quickly.", "This is not an easy plant to propagate; but you can try using stem cuttings.", "A Creeping Fig has a #1 toxicity  ", ".", "You’re allowing the soil to get too dry. Always keep the soil moist but never soggy.", "A creeping fig likes humidity, but keeping the leaves wet from misting attracts  ", ". That’s what those “white, sticky, cotton- like” things are. Try putting your ficus on a bed of wet pebbles to increase the humidity. Spray your plants with the  ", " to get rid of the  ", "; be sure to reach both sides of the leaves and all parts of the plant.", "A creeping fig does best when it is root bound in a small pot. For the first year or two, when the plant is immature and small, repot it in the spring. Be sure to use a pot only an inch or two larger than the original pot. Once the plant is mature it does not need repotting; merely replace the top few inches of soil with new rich organic soil once a year.", "It sounds like the plant is getting too much sun. Move it away from a southern or western exposure to a northern or eastern exposure. Also examine the plant closely to make sure it doesn’t have  ", "."], "species": ["Ficus pumila"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Diseases", "Soil", "Propagation", "Poisonous Plant Info", "1. Why are all of the green leaves on my Desert Rose Plant are dropping off?", "2. Why doesn't my Desert Rose Plant have a  fat neat -looking trunk like some Other Desert Rose Plants I've seen?", "3. How can I make my bare and leggy looking Desert Rose plant look better?", "4. How can I get more flowers on my Desert Rose Plant?"], "name": ["Desert Rose Plant"], "value": ["A Desert Rose Plant needs  ", ".", "The fat bulbous trunk of a Desert Rose Plant stores water so be sure the soil totally dries out before watering this plant. If the soil of a Desert Rose Plant gets excessively dry, the plant becomes dormant until you give it some water and wake it up.", "Fertilize a Desert Rose Plant with a plant food specifically recommended for flowering plants. The food for flowering plants should always be lower in nitrogen and higher in phosphorous  (10/20/10). Feed a Desert Rose Plant monthly from late spring until the early fall. When feeding a Desert Rose Plant, always reduce the plant food to ½ the recommended strength.", "A Desert Rose requires very warm temperatures. Keep the room above 60 degrees and avoid placing a Desert Rose near air conditioners or cold drafts.", "This plant does well in basic household humidity.", "Flowering occurs throughout the year but is more prolific in the spring and fall. Older plants that are well cared for produce the most blooms. The flowers come in red,white, pink, and rose.", "Aphid,  ", ", and  ", " are problems for a Desert Rose. Spraying with the  ", " should handle most infestations.", "Most fungal or bacterial diseases that affect a Desert Rose, such as CrownRoot, and Stem rot are the result of over- watering. Always allow the soil to dry out. It's important to keep water off of the leaves, flowers, and stems of a Desert Rose.", "The soil for a Desert Rose needs to be a loose fast draining mixture that won’t become soggy and heavy. Add hard sand to your usual potting soil or buy a mixture made specifically for cacti and  ", "s", " ", " from seeds is best, but rarely possible when a Desert Rose is an indoor plant. Stem cuttings can be used to propagate a Desert Rose plant but the new plants often lack the trunks with fat bases that make a Desert Rose Plant so interesting.", "A Desert Rose plant is a  ", " houseplant with a #2 Toxicity  ", ".", "Leaves fall off a desert Rose plant when it is over-watered. A Desert Rose plant is a  ", " that requires very little water.", "Here are a few hints that might help your Desert Rose Plant develop a thicker trunk: When you repot your Desert Rose Plant, lift the root ball higher in the new pot so that the top part of the roots is exposed. Feed your Desert Rose Plant with a good  ", " high in phosphorus. This should help the trunk of your Desert Rose become more bulbous.", "You need to aggressively prune your Desert Rose plant if you want it to look better. Cut back two or three of the stems on your Desert Rose Plant, almost to the main trunk, and place the plant in  ", ". The new growth on your Desert Rose Plant should start within three or four weeks; then cut the next two stems back. Check our Glossary under  ", "/ ", " to see how you can use these stem cuttings to start new plants.", "A Desert Rose Plant requires a great deal of  ", " to flower. Desert Rose plants also need to be fed with a  ", " high in phosphorous, that's the middle number on a plant food package (10/20/10), in order to bloom. A Desert Rose Plant will flower more in the spring and fall than in summer and winter."], "species": ["Adenium obesum"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Diseases", "Soil", "Pot Size", "Pruning", "Propagation", "Poisonous Plant Info", "Do Hindu Rope Houseplants have a pleasant smell or am I just imagining this?", "Should I remove the thick stalks that are growing on my Hindu Rope Plant?"], "name": ["Hindu Rope Plant"], "value": ["All Hindu Rope HousePlants, both green and variegated, grow best in very  ", ". Southern exposure is best, but a Hindu Rope HousePlant can adapt to east or west locations in front of a window. A Hindu Rope Plant may never bloom when the light is inadequate.", "All Hoya Houseplants, including the Hindu Rope Plant, are  ", " that require very little water. Water Hindu Rope HousePlants when the soil is almost dry. During the winter, water all Hoya HousePlants even less.", "Feed Hindu Rope Houseplants monthly during the spring and summer with a water-soluble plant food diluted to 1/2 the recommended strength. Use a  ", " high in potassium to encourage Hindu Rope Plants to bloom.", "Hindu Rope HousePlants prefer daytime temperatures of 70 degrees (F) or higher and nighttime temperatures between 60 and 65 degrees (F). These temperatures encourage the Hindu Rope Plants to bloom in the late spring and summer once they have matured.", "Basic household humidity for Hindu Rope HousePlants.", "Hindu Rope HousePlants are slow growing  ", " that take several years to produce clusters of star-shaped waxy flowers on long vines. Hindu Rope HousePlants bloom in late spring & early summer when given proper light, water, and  ", ". Do not remove the leafless spurs or stubs that appear on Hindu Rope HousePlants because this is where the new flowers appear every year.", "The most common houseplant pest that attacks Hindu Rope HousePlants is the  ", ".  ", " get inside the curly twists and turns of the Hoya Plant leaves. The best way to get rid of these plant pests is to spray all parts of Hindu Rope Houseplants with the  ", ".  ", " may appear of the new growth of Hindu Rope Plants and can be treated with the  ", " or an  ", ".", "The main plant diseases that affect a Hindu Rope HousePlants are  ", ", a fungus that causes grayish areas on the leaves and Stem and Root Rot caused by over-watering.", "Use a well-aerated fast-draining potting soil for Hindu Rope HousePlants. Add a little sand to the soil to loosen it up if the soil seems heavy.", "Hindu Rope HousePlants should be kept in small pots to prevent over- watering.", "Never totally cut off the old stems of a Hindu Rope House Plants since this is where the new flowers develop.", "Hindu Rope HousePlants, Hoya carnosa \"Krinkle Kurl,\" can be propagated anytime using stem-tip cuttings. A portion of the Hoya Plant stem, including one or more pairs of leaves, quickly produces roots in water or damp sand.", "A Hindu Rope Plant is a non- ", " houseplant.", "The flowers of Hindu Rope Houseplants do produce a distinctive mocha aroma.", "Do not remove the thick stalks, which are called Peduncles, that are growing on your Hindu Rope HousePlants since the plant's flowers grow out of these peduncles. After blooming, if you don't remove the dead flowers or the peduncles on Hindu Rope HousePlants, the plant produces even more flowers."], "species": ["Hoya Carnosa Compacta"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Diseases", "Soil", "Pot Size", "Pruning", "Propagation", "Poisonous Plant Info", "What should I do to help my Hoya houseplants get flowers?", "Should I cut the flowers off of my Hoya houseplant once they die?", "How do I get rid of mealy bugs on my Hoya houseplants? I have a beautiful Hoya Plant with long vines twisted around each other. The plant has mealy bugs and no matter how much I spray they keep coming back in areas I can’t seem to reach."], "name": ["Hoya Plant"], "value": ["Hoya Plants do best and bloom more often in very  ", ". They are one of the few indoor houseplants that can even thrive in direct sun. Although Hoya Plants can adapt to lower light, they grow slower and do not produce the fragrant waxy flowers that are so beautiful.", "Hoya Plants are  ", ". The soil of a Hoya Plant should dry out before being watered. These plants do thrive on neglect, but need additional water when in bloom.", "Feed a Hoya Plant monthly with a balanced houseplant food at 1/2 the recommended strength when it is actively growing.", "Hoya Plants can adapt to almost any moderate temperature, but prefer 60-65 degrees at night and 70-80 degrees during the day.", "Provide basic household humidity or lower for Hoya Houseplants.", "A Hoya Plant produces beautiful clusters of fragrant flowers in numerous colors. Each Hoya flower has five waxy petals. New flowers develop on the older stems of a Hoya Plant so never cut off the old flower stems.", "Hoya Plants are bothered by  ", ",  ", ", and  ", ". Spray the entire Hoya plant, reaching every little twisted section if possible, with the  ", " to treat plant pests.", "The main plant diseases that affect Hoya Plants are  ", ", a fungus that causes grayish areas on the leaves, and  ", ", a fungal disease caused by humid warm conditions, wet leaves, soggy soil, and poor air circulation.", "Use a well-aerated fast-draining potting soil for a Hoya Plant. Add a little sand to the soil if it seems too heavy and is not drying out quickly.", "Keep a Hoya Plant in small pots that have drip holes in the bottom to prevent over-watering.", "Never totally cut off the old stems of a Hoya Plant since this is where the new flowers develop.", "Hoya Plants are easy to propagate using stem tip cuttings from the new vines.", "Hoya Plants are non- ", ".", "Hoya houseplants need very  ", " in order to bloom more often and produce more flowers. Another thing to keep in mind is that mature Hoya Plants bloom more often.", "New flowers develop on the old flower stems of a Hoya Plant so never cut off the old stems. The flowers grow in an “umbel” like an upside down umbrella and there may be one to 50 flowers in each umbel.", "You can try to get rid of  ", " on Hoya houseplants by spraying the entire plant with the \"  ", "\" (8oz. water & 8oz. alcohol, add two tablespoons of biodegradable soap and two tablespoons of mineral oil). You can read more about this simple remedy in the Glossary of the website. You can also purchase a very small pesticide bomb at your local nursery. Place your Hoya Plant in a plastic bag, release the bomb, and seal the plastic bag. Leave your Hoya Plant in the bag for 24 hours. I prefer the \" ", "\" since it doesn't use chemicals."], "species": ["Hoya carnosa"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Diseases", "Soil", "Pot Size", "Pruning", "Propagation", "Poisonous Plant Info", "Why do Hoya flower buds dry up and fall off without opening?", "Why doesn't my Hoya Plant bloom?", "Can Hoya Plants grow and get flowers under fluorescent light?"], "name": ["Hoya Shooting Stars Plant"], "value": ["Hoya Plants do best and bloom more in very  ", ". Hoya Plants are one of the few indoor houseplants that can even thrive in direct sun. Although Hoya Plants can adapt to lower light, they grow slower and do not produce the fragrant porcelain- like flowers that are so beautiful.", "Hoya Plants are  ", "s and need to completely dry out before being watered. Hoya Plants do thrive on neglect, but need additional water when in bloom.", "Feed a Hoya Plant monthly with a balanced houseplant food at 1/2 the recommended strength when it is actively growing.", "Hoya Plants can adapt to any temperature but prefer 60-65 degrees at night and 70-80 degrees during the day.", "Provide basic household humidity or lower for a Hoya Plant.", "A Hoya Shooting Stars Plant produces beautiful clusters of fragrant flowers in white and yellow. Each Hoya flower has five waxy petals. New flowers develop on the old flower stems of a Hoya Plant so never cut off the old stems.", "Hoya Plants are prone to plant pests such as  ", ",  ", ", and  ", ". Spray the entire Hoya plant, reaching every little twisted section if possible, with the  ", " to treat plant pests.", "The main plant diseases that affect Hoya Plants are  ", ", a fungus that causes grayish areas on the leaves and Stem and Root Rot caused by over-watering.", "Use a well-aerated fast-draining potting soil for a Hoya plant. Add a little sand to the soil to loosen it up even more if the soil seems heavy..", "Pot size for a Hoya Plant should be no larger that 1\"-2\" bigger than the root ball.", "Never totally cut off the old stems of a Hoya Shooting Stars Plant  since this is where the new flowers develop.", "Hoya Plants are easy to propagate using stem clippings from the new vines.", "Hoya Plants are non- ", ".", "Hoya flower buds dry up and fall off if the plant gets very dry. Hoya flower buds get spongy and fall off when the plant is over-watered.", "The main reason mature Hoya Plants don't bloom is because they are not getting enough light.", "Hoya plants bloom very well under fluorescent light."], "species": ["Hoya Multiflora"]},
{"key": ["Light", "Water", "Fertilizer", "Temperature", "Humidity", "Flowering", "Pests", "Diseases", "Soil", "Pot Size", "Pruning", "Propagation", "Poisonous Plant Info", "Why are the new, baby leaves on my Hawaiian Schefflera turning black and dying? The older green leaves are falling off also.", "Can I put my Arboricola on a desk in an office with a small window but good artificial light?", "Why are the leaves on my Hawaiian Schefflera losing their color? What is the reddish webbing I see on the plant?", "Why does my green Arboricola get yellow leaves?"], "name": ["Hawaiian Schefflera Plant"], "value": ["The brighter the light the faster and bushier a Hawaiian Schefflera Plant grows. Variegated Hawaiian Scheffleras, like the Capella, require more light than solid green varieties. Direct sun burns the leaves of any type of Schefflera.", "Water a Hawaiian Schefflera Plant well and then allow the top 1/3 of the soil to dry out before watering again. Seemingly healthy leaves fall off and new growth turns black when a Hawaiian Schefflera plant is over- watered. Leaves turn bright yellow when a Hawaiian Schefflera Plant needs more water.", "Fertilize a Hawaiian Schefflera plant monthly in the spring and summer with a basic houseplant food at 1/2 the recommended strength. Avoid feeding an Arboricola when the plant is not actively growing.", "Hawaiian Schefflera plants grow well in normal household temperatures. Try to keep Schefflera Plants out of cold drafts and away from heaters and air conditioners.", "Normal household humidity is sufficient for a Hawaiian Schefflera.", "Hawaiian Scheffleras may flower when used as an outdoor plant, but do not produce blooms as an indoor houseplant.", " ", ",  ", ",  ", ", and  ", " are plant pests that can attack a Hawaiian Schefflera. These annoying insects especially like the tender, new growth.", "Bacterial Leaf Diseases such as Leaf Blight and Fungal Leaf Diseases such as Leaf Spot may cause problems for a Hawaiian Schefflera when the leaves are kept wet and the humidity is high.", "Use a well-aerated loose potting soil that retains water but drains quickly for Hawaiian Schefflera Plants.", "Hawaiian Scheffleras prefer to be root-bound in small pots. This also helps prevent over-watering.", "Aggressively prune a Hawaiian Schefflera when it gets too large or looks thin and leggy. All Schefflera Plants love to be pruned. New growth on your Arboricola will appear directly below where you cut the stem, so try to make your cut above a stem node.", "Use stem cuttings and  ", " to propagate a Hawaiian Schefflera.", "Hawaiian Scheffleras are considered to be  ", " with a #1 Toxicity  ", ". Pets and children are attracted to the shiny leaves on an Arboricola, so keep this plant out of reach.", "The leaves on a Hawaiian Schefflera Plant turn black and green leaves fall off when the plant is over-watered. You should also check to be sure there are no pests such as  ", ",  ", ", or  ", " feeding on the new growth.", "Solid green Arboricolas do very well under those conditions, although the new leaves may be smaller and the plant a little less bushy than if it had brighter light. Don’t use the Capella variety (variegated Hawaiian Schefflera) since it needs more light to maintain the yellow coloring in the leaves.", "The leaves of your Hawaiian Schefflera are losing their color and the webs on the plant are both caused by a plant pest called  ", ". Spray your Hawaiian Schefflera with the “ ", "” every 10 days for at least a month.", "All Scheffleras, both Hawaiian Scheffleras and Umbrella Plant Scheffleras, develop yellow leaves when they are not getting enough water. When you water, water well, until water comes out the bottom drip holes in the pot. Then, do not water again until at least the top 1/3 of the soil has dried out. If green leaves fall off, you’ve over compensated and are now giving your plant too much water."], "species": ["Schefflera arboricola"]}[
